{
  "education": [
    {
      "awards_achievements": [
        "Entrance Scholarship",
        "Dean's List (2019-2020, 2020-2021)"
      ],
      "degree": "Bachelor of Sciences",
      "department": "Computer Science",
      "duration": "September 2017- December 2021",
      "school_name": "Ryerson University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_JoonhoMyung",
  "highlighted_projects": [
    {
      "description": "Suspendisse a tincidunt odio. Suspendisse posuere luctus aliquet. Quisque magna tellus, tempor vitae arcu sed, volutpat scelerisque lacus. Aliquam varius pulvinar dapibus. Ut a tincidunt sem. Aenean sollicitudin fringilla erat ut imperdiet. Phasellus fermentum, enim vitae laoreet elementum, eros nisl hendrerit lorem.",
      "git_url": "https://github.com/jarviscanada/jarvis_profile_builder",
      "name": "Web app for resturant"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed and written bash scripts using terminal and used various technologies to save hardware specifications and resource usage data into database using Docker container and PSQL instance. This script was executed to manage the Linux cluster running on Linux distro CentOS 7. Also, CRONTAB command was used in monitoring agent to record resource usage of each node in real-time.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam.",
        "JDBC App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam.",
        "Grep App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Joonho Myung",
  "others": [
    {
      "bullets": [
        "Udacity Machine Learning (2019)"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Winner"
      ],
      "title": "Awards"
    },
    {
      "bullets": [
        "Soccer player",
        "Love watching sports",
        "Love playing sports games"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Donec mattis sed justo et sagittis. Vestibulum lacinia nulla ipsum. Curabitur imperdiet nibh vitae leo lacinia laoreet. Nullam accumsan, lectus ut maximus ultricies, augue justo egestas mi, vel bibendum felis.",
      "duration": "2022-present",
      "title": "Software Developer"
    }
  ],
  "skills": {
    "competent": [
      "Docker",
      "HTML/CSS",
      "Donec",
      "fermentum",
      "Donec"
    ],
    "familiar": [
      "Docker",
      "C/C++",
      "fermentum",
      "fermentum",
      "fermentum"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "I am a recent graduate from Ryerson University, currently changed their name to Toronto Metropolitan University, with a Bachelor of Science (Honours). During my education, I learned software engineering, the fundamentals of data structure, and familiarized myself with various coding languages. I can work on projects with many different languages which are Java, the language most I'm proficient with, SQL, HTTP/CSS, and Bash. I'm currently working as Software Developer from Jarvis Consulting Group and I'm working on improving my skill sets to be prepared for the workspace. I am using an agile approach to manage my projects and these projects enable me to widen the ability to use new technologies like Docker and PostgreSQL."
}
